TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ПодтвержденияДоставкиСообщений/гкс_ПодтвержденияДоставкиСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ПодтвержденияДоставкиСообщений</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.гкс_СостоянияИсходящихСообщенийRMQ</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомлениеПоОшибкеСформировано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>DocumentRef.гкс_НаправлениеНаРазгрузку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_СостоянияИсходящихСообщенийRMQ/гкс_СостоянияИсходящихСообщенийRMQ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_СостоянияИсходящихСообщенийRMQ</name>
  <enumValues>
    <name>Подготовлено</name>
  </enumValues>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
  <enumValues>
    <name>Доставлено</name>
  </enumValues>
  <enumValues>
    <name>ДоставленоИОбработано</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработкиПолучателем</name>
  </enumValues>
  <enumValues>
    <name>Пропущено</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаФормированияСостояния</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработкиЗакрыто</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ПодтвержденияДоставкиСообщений/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает ссылку на Источник по Идентификатору события.
// 
// Параметры:
//  ИдентификаторСобытия - Строка - Идентификатор события для отбора записей.
// 
// Возвращаемое значение:
//  ДокументСсылка.гкс_НаправлениеНаРазгрузку, Неопределено - надейнный Источник.
Функция ИсточникПоИдентификаторуСобытия(ИдентификаторСобытия) Экспорт 
	
	Источник = Неопределено;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторСобытия", ИдентификаторСобытия);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПодтвержденияДоставкиСообщений.Источник КАК Источник
	|ИЗ
	|	РегистрСведений.гкс_ПодтвержденияДоставкиСообщений.СрезПоследних(, ИдентификаторСобытия = &ИдентификаторСобытия) КАК
	|		ПодтвержденияДоставкиСообщений";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда 
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Источник = Выборка.Источник;
		
	КонецЕсли;
	
	Возврат Источник;
	
КонецФункции

// Проверяет наличие записей по Состоянию и Идентификатору сообщения.
// 
// Параметры:
//  Состояние - ПеречислениеСсылка.гкс_СостоянияИсходящихСообщенийRMQ
//  ИдентификаторСообщения - Строка
// 
// Возвращаемое значение:
//  Булево - Истина, если для переданных параметров найдена запись.
Функция СостояниеСообщенияОтражено(Состояние, ИдентификаторСообщения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Состояние", Состояние);
	Запрос.УстановитьПараметр("ИдентификаторСообщения", ИдентификаторСообщения);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПодтвержденияДоставкиСообщений.ИдентификаторСобытия КАК ИдентификаторСобытия
	|ИЗ
	|	РегистрСведений.гкс_ПодтвержденияДоставкиСообщений.СрезПоследних(, Состояние = &Состояние
	|	И ИдентификаторСообщения = &ИдентификаторСообщения) КАК ПодтвержденияДоставкиСообщений";
	РезультатЗапроса = Запрос.Выполнить();
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

// Состояние соответствующее успешной обработке входящего сообщения.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.гкс_СостоянияИсходящихСообщенийRMQ - Состояние успешно для входящего сообщения
Функция СостояниеУспешноДляВходящегоСообщения() Экспорт 
	Возврат Перечисления.гкс_СостоянияИсходящихСообщенийRMQ.ДоставленоИОбработано;
КонецФункции

// Состояние соответствующее ошибке обработки входящего сообщения.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.гкс_СостоянияИсходящихСообщенийRMQ - Состояние ошибка для входящего сообщения
Функция СостояниеОшибкаДляВходящегоСообщения() Экспорт 
	Возврат Перечисления.гкс_СостоянияИсходящихСообщенийRMQ.ОшибкаОбработкиПолучателем;
КонецФункции

#КонецОбласти

#КонецЕсли
